GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x8d0: file p5final.c, line 34.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p5final.c:34
34    {
(gdb) n
36      n=input_size();
(gdb) n
enter the size of array
5
37      int a[n];
(gdb) 
38    input_array(n,a);
(gdb) n
enter the elements of array4
enter the elements of array3
enter the elements of array2
enter the elements of array1
enter the elements of array6
39     largest=find_largest(n,a);
(gdb) n
40      output(n,a,largest);
(gdb) n
41      return 0;
(gdb) n
42      }
(gdb) s
__libc_start_main (main=0x55f954e008bf <main>, argc=1, argv=0x7ffda6c11cc8, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffda6c11cb8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
index of largest element is 5[Inferior 1 (process 3190) exited normally]
(gdb) l
339 in ../csu/libc-start.c
(gdb) 
